/*****************************************
*   
                  
*  CreateDate: 2015-05-18
*  CreateBy: Starry
*  Version: 1.0.0.0

*  ModifyDate: xxxx-xx-xx
*  ModifyBy: xxxxx
*  Version: 1.0.0.0
*****************************************/



/*---------------全局参数定义区域---begin-----*/

/*--其他全局参数定义区域--*/

/*模板控件id前缀*/
var _prex = "_ctrlTmpl_";

/*------------------------*/




/*--接受验证的DB字段名称--*/
/*员工工号*/
var _emplno = "EmployeeNO";

/*流程单(工单)号*/
var _frmno = "FormNO";

/*周转工具号*/
var _trunno = "TurnoverNO";
/*--------------------*/

/*-----------------------------------end------*/





/**************备注***************
控件ID = _prex + DB字段名称

例如：员工工号控件ID = _prex + _emplno
      ......
*********************************/








/*验证【员工工号】:
    1. 是否存在
    2. 对当前工位是否有操作技能证书
要求：
    1. 不通过时，返回错误信息文本，当前控件内容全选并获得焦点
    2. 通过时，  仅返回空字符串""
*/
function ValidateOperator() {
    var errorMsg = "";

    /*...逻辑代码编写...*/

    return errorMsg;
}


/*验证【流程单(工单)号码】:
    1. 是否存在
    2. 状态未关闭
要求：
    1. 不通过时，返回错误信息文本，当前控件内容全选并获得焦点
    2. 通过时，  仅返回空字符串""
*/
function ValidateWorkorder() {
    var errorMsg = "";

    /*...逻辑代码编写...*/

    return errorMsg;
}

/*验证【周转工具号】:
    1. 是否存在
    2. 是否与当前工单绑定，并且应该在当前工位
要求：
    1. 不通过时，返回错误信息文本，当前控件内容全选并获得焦点
    2. 通过时，  仅返回空字符串""
*/
function ValidateTurnover() {
    var errorMsg = "";

    /*...逻辑代码编写...*/

    return errorMsg;
}